{
  "backend/main.mo": "Motoko canister storing contact submissions with validation and per-caller rate limiting, providing functions to submit and retrieve contacts.",
  "feature_evidence.json": "Feature evidence report listing implemented features, involved files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Pre-generated summaries describing the purpose of each frontend source file and asset.",
  "frontend/index.css": "Global Tailwind CSS setup defining color tokens, dark mode variables, and base styles.",
  "frontend/index.html": "Base HTML template loading the React app and defining metadata for SEO and social previews.",
  "frontend/src/App.tsx": "Root React component assembling all site sections and applying SEO metadata from config.",
  "frontend/src/components/Footer.tsx": "Footer component showing branding, quick links, and attribution with link-handling logic.",
  "frontend/src/components/sections/ArduinoCodeSection.tsx": "Renders an Arduino sketch with a copy-to-clipboard button and displays code using the provided temperature threshold.",
  "frontend/src/components/sections/ContactSection.tsx": "Implements a contact form with validation, submission handling, and status feedback.",
  "frontend/src/components/sections/DemoMediaSection.tsx": "Displays demo media including an optional video and images with fallback handling for load errors.",
  "frontend/src/components/sections/FeaturesSection.tsx": "Shows a grid of feature cards and a banner image based on a provided features list.",
  "frontend/src/components/sections/HeroSection.tsx": "Builds a hero header with background image, project branding, and CTA buttons with scroll or link actions.",
  "frontend/src/components/sections/ManualSection.tsx": "Presents a user manual containing required components, wiring instructions, and setup steps using the temperature threshold.",
  "frontend/src/components/sections/OverviewSection.tsx": "Shows the project overview text in a styled centered layout.",
  "frontend/src/components/sections/PracticalApplicationsSection.tsx": "Displays a grid of application cards with icons and logic details plus a hysteresis note alert.",
  "frontend/src/components/sections/TechStackSection.tsx": "Renders a tech stack section showing each technology as a styled badge.",
  "frontend/src/components/sections/ThresholdDiagramSection.tsx": "Provides an interactive temperature simulation that visualizes threshold behavior and fan activation.",
  "frontend/src/components/TopNav.tsx": "Responsive top navigation bar with scroll-based styling, smooth section scrolling, and mobile menu.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor based on user identity and invalidates queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider with login, logout, and identity persistence logic.",
  "frontend/src/hooks/useQueries.ts": "Fetches all contacts using the current actor and updates the cached actor instance.",
  "frontend/src/hooks/useSubmitContact.ts": "Handles submitting a contact form with loading, success, and error state management.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode colors, and animation keyframes.",
  "frontend/src/lib/backendClient.ts": "Provides helper functions for submitting and retrieving contact data using a cached backend actor.",
  "frontend/src/lib/resolveAppUrl.ts": "Resolves asset paths to full URLs based on the app's base URL.",
  "frontend/src/main.tsx": "Bootstraps the React app with query client and Internet Identity provider.",
  "frontend/src/siteConfig.ts": "Defines TypeScript interfaces for site configuration and exports the full config object containing project details, features, applications, media, and SEO settings.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Stores project metadata, architecture notes, known issues, generated assets, and a list of existing implemented features with versions."
}