{
  "backend/main.mo": "Motoko backend actor managing user profiles, contact submissions with rate limiting, admin-restricted queries, and authorization mixins.",
  "feature_evidence.json": "Structured feature evidence report mapping feature IDs to affected files, components, and test references.",
  "frontend-file-summaries.txt": "List of high-level summaries for all frontend source files, describing each component’s purpose and behavior.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH color variables, themes, and global styles for light and dark mode.",
  "frontend/index.html": "HTML entry point defining basic metadata, root mount element, and module script loader.",
  "frontend/src/App.tsx": "Main React app component wiring together all sections, updating SEO meta tags, and passing config-driven props.",
  "frontend/src/components/Footer.tsx": "Footer component showing branding, quick links with smooth scrolling or external navigation, and a credits bar.",
  "frontend/src/components/sections/ArduinoCodeSection.tsx": "Displays Arduino code with metadata badges and allows users to copy the sketch using a copy-to-clipboard button.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact form with validation, submission handling, and success/error states using custom hooks.",
  "frontend/src/components/sections/DemoMediaSection.tsx": "Renders demo video and image gallery with error handling, or a placeholder when media is unavailable.",
  "frontend/src/components/sections/FeaturesSection.tsx": "Displays a grid of feature cards and an icon banner based on provided feature data.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background image, project title, tagline, and CTA buttons that handle scrolling or external links.",
  "frontend/src/components/sections/ManualSection.tsx": "Renders a detailed user manual section with component lists and wiring instructions for the DHT11 project.",
  "frontend/src/components/sections/OverviewSection.tsx": "Displays a simple project overview section showing descriptive text passed as a prop.",
  "frontend/src/components/sections/PracticalApplicationsSection.tsx": "Renders a grid of real‑world application cards and a hysteresis warning note using icons and structured props.",
  "frontend/src/components/sections/TechStackSection.tsx": "Shows a list of tech stack items as badges in a styled section.",
  "frontend/src/components/sections/ThresholdDiagramSection.tsx": "Provides an interactive temperature simulation with hysteresis logic that toggles a fan display.",
  "frontend/src/components/TopNav.tsx": "Responsive top navigation bar with scroll-aware styling, smooth section scrolling, and mobile menu toggle.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context provider and hook handling login, identity loading, and state management.",
  "frontend/src/hooks/useQueries.ts": "Updates a global backend client instance whenever the actor returned by useActor changes.",
  "frontend/src/hooks/useSubmitContact.ts": "Manages contact form submission state, success/error handling, and time‑based reset behavior.",
  "frontend/src/index.css": "Defines Tailwind layers, light/dark theme CSS variables, base styles, and animation keyframes/classes.",
  "frontend/src/lib/backendClient.ts": "Caches and initializes a backend actor and exposes a function to submit contact form data with error handling.",
  "frontend/src/lib/resolveAppUrl.ts": "Resolves relative asset paths to full URLs using Vite’s BASE_URL, preserving absolute URLs.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, loading global styles.",
  "frontend/src/siteConfig.ts": "Contains typed site configuration including project details, features, applications, notes, and SEO metadata.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors, themes, animations, and plugins like typography and container queries.",
  "project_state.json": "Describes the project's current state, features, architecture notes, generated assets, and known issues."
}