{
  "kind": "build_request",
  "title": "Fix Demo & Media image not loading and re-add asset",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Re-add the user-uploaded demo image asset to the frontend static assets so it is present in production and matches the path referenced by the app (currently `frontend/src/siteConfig.ts` uses `/assets/whatsapp-image-2026-02-06-092349.jpeg`).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "re add the image it still not opening"
        ]
      },
      "acceptanceCriteria": [
        "The file exists at the expected public path at build time (e.g., `frontend/public/assets/whatsapp-image-2026-02-06-092349.jpeg`) and is included in the production build output.",
        "Loading the image URL in the deployed app returns HTTP 200 and displays the image (no broken image icon)."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Make Demo & Media image URLs robust to the deployed base path by resolving `siteConfig.media.images` entries using the app base URL (avoid hard-coded leading `/` paths that can break in production).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "re add the image it still not opening"
        ]
      },
      "acceptanceCriteria": [
        "With the deployed canister URL (including any subpath/base), the demo image renders correctly without manual refreshes or URL edits.",
        "`frontend/src/siteConfig.ts` and the DemoMedia section use a consistent convention (either relative paths like `assets/...` or base-url-resolved absolute URLs) so the image works in local dev and production."
      ]
    },
    {
      "id": "REQ-8",
      "text": "In `frontend/src/components/sections/DemoMediaSection.tsx`, add a user-friendly fallback when an image fails to load (e.g., show a short English error message and/or a placeholder block instead of a broken image).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "re add the image it still not opening"
        ]
      },
      "acceptanceCriteria": [
        "If the image URL is invalid, the UI shows an English fallback state (not an empty/broken image) while keeping the rest of the section usable.",
        "The console does not show uncaught runtime errors from image load failures."
      ]
    },
    {
      "id": "REQ-9",
      "text": "Allow users to open the demo image at full size by making each Demo & Media image clickable (open the original image URL in a new tab/window).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "re add the image it still not opening"
        ]
      },
      "acceptanceCriteria": [
        "Clicking a demo image opens the full-resolution image in a new browser tab (with appropriate `target`/`rel` attributes).",
        "This works for all entries in `siteConfig.media.images`."
      ]
    }
  ],
  "constraints": [
    "Do not modify any files under `frontend/src/components/ui` (read-only shadcn/ui sources).",
    "Keep the backend architecture unchanged (no new canisters/services)."
  ],
  "nonGoals": [
    "Adding new media types beyond the existing `videoUrl` and `images` fields.",
    "Changing the content of the landing page sections unrelated to Demo & Media."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}